wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
// No more ifdefs

// List of devices:
// #define ESP1 // Test Arbeitszimmer
// #define ESP2 // Kueche
// #define ESP3 // Wohnzimmer
// #define ESP4 // Garten
// #define ESP6 // Test mit Lithium-Akku
// #define ESP7  // Hausanschlussraum
// #define ESP8 // Fernsehzimmer
// #define ESP9 // Heizraum
// #define ESP10 // Flur 1.OG
// #define ESP11 // Lolin32 Lite
// #define ESP12 // Schlafzimmer
// #define ESP13 // Lichterkette / Uhr
// #define ESP14 // Display
// #define ESP15 // Keller
// #define ESP16 // Flur EG
// #define ESP17 // DECIX Office
// #define ESP18 // Flur 2.OG
// #define ESP19 // Loggia
// #define ESP31 // Test
// #define ESP30 // DingDong

#include <Arduino.h>
#include <ArduinoLog.h>

#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266WiFi.h>
#include <AddrList.h>
#include <FS.h>
#define I2CSDA 4  //D2 gruen
#define I2CSCL 5  //D1 gelb
ADC_MODE(ADC_VCC);

#elif defined (ARDUINO_ARCH_ESP32)
#include <WiFi.h>
#include <SPIFFS.h>

#include "esp_bt.h"
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"
typedef enum {
    APP_GAP_STATE_IDLE = 0,
    APP_GAP_STATE_DEVICE_DISCOVERING,
    APP_GAP_STATE_DEVICE_DISCOVER_COMPLETE,
    APP_GAP_STATE_SERVICE_DISCOVERING,
    APP_GAP_STATE_SERVICE_DISCOVER_COMPLETE,
} app_gap_state_t;

typedef struct {
    bool dev_found;
    uint8_t bdname_len;
    uint8_t eir_len;
    uint8_t rssi;
    uint32_t cod;
    uint8_t eir[ESP_BT_GAP_EIR_DATA_LEN];
    uint8_t bdname[ESP_BT_GAP_MAX_BDNAME_LEN + 1];
    esp_bd_addr_t bda;
    app_gap_state_t state;
} app_gap_cb_t;

static app_gap_cb_t m_dev_info;

#else

#pragma message ("unknow build enviroment")
#error
#endif

// Board dependencies
#if defined(BOARD_HELTEC)
#define I2CSDA 4  //D2 gruen
#define I2CSCL 15  //D1 gelb
#endif

#include <PubSubClient.h>
#include <ArduinoJson.h>


// Sensor Libraries
#include <Wire.h>
#include "Adafruit_Si7021.h"
#include "Adafruit_BME280.h"
#include "Adafruit_BME680.h"
#include "Adafruit_TSL2561_U.h"
#include <Adafruit_NeoPixel.h>
#include "Adafruit_VEML6070.h"
#include "Adafruit_ADS1015.h"
#include "Adafruit_VL53L0X.h"
#include "Adafruit_TCS34725.h"
#include "Adafruit_CCS811.h"
#include <U8x8lib.h>
#include <SparkFun_AS3935.h>

// Global defines
#define NEOPIXEL 14 //D5

#define AS3935_ADDR 0x03

// Global Objects
uint8_t nrofleds = 1;
Adafruit_Si7021 si7021;
Adafruit_BME280 bme280;
Adafruit_BME680 bme680;
Adafruit_CCS811 ccs;
Adafruit_TSL2561_Unified tsl2561 = Adafruit_TSL2561_Unified(TSL2561_ADDR_FLOAT);
Adafruit_VEML6070 veml = Adafruit_VEML6070();
Adafruit_VL53L0X lox = Adafruit_VL53L0X();
Adafruit_ADS1115 ads1115;
SparkFun_AS3935 as3935(AS3935_ADDR);
Adafruit_NeoPixel led = Adafruit_NeoPixel(nrofleds, NEOPIXEL, NEO_GRB + NEO_KHZ800);
Adafruit_TCS34725 tcs = Adafruit_TCS34725();
WiFiClient espClient;
PubSubClient client;
U8X8_SH1106_128X64_NONAME_HW_I2C u8x8(/* reset=*/ U8X8_PIN_NONE);
int pirState = LOW;
uint8_t pirInput = 12;
uint8_t as3935_input = 13; // D7 hardware int pin for AS3935
uint8_t as3935_tunecap = 96;
bool as3935_inconfig = false;


unsigned transmission_delay = 60; // seconds
uint32_t led_current_color;

// Strings for dynamic config
String Smyname, Spass, Sssid, Smqttserver, Ssite, Sroom, Smqttuser, Smqttpass;
unsigned int Imqttport;
bool Bflipped;
bool Bindoor = true;
bool Bco2alert = false; // CO2-Ampel


// Flags for sensors found
bool si7021_found = false;
bool bme280_found = false;
bool bme680_found = false;
bool tsl2561_found= false;
bool voltage_found= true;
bool ccs811_found = false;
bool u8x8_found = false;
bool veml_found = false;
bool lox_found = false;
bool tcs_found = false;
bool ads1115_found = false;
bool rtc_init_done = false;
bool rtc_alarm_raised = false;
bool light_on = true;
bool pir_found = true;
bool as3935_found = false;

bool color_watch = false;

// Floats for calibration
float bme280TempAdjust = 0.0;
float si7021TempAdjust = 0.0;

// Flags for display
#define DISPLAY_OFF 0
#define DISPLAY_TEMPERATURE 1
#define DISPLAY_HUMIDITY 2
#define DISPLAY_AIRPRESSURE 3
#define DISPLAY_LUX 4
#define DISPLAY_STRING 5
#define DISPLAY_DISTANCE 6
#define DISPLAY_TEMPHUM 7
#define DISPLAY_CO2 8


unsigned int display_what = DISPLAY_TEMPHUM;
unsigned int display_brightness = 1;
bool display_refresh = true;

// Timer variables
unsigned long now;
unsigned long last_transmission = 0;
unsigned long last_display = 0;

// forward declarations
boolean setup_wifi();
void loop_publish_tcs34725();
void publish_status();
void publish_as3935();
void publish_bme280();
void publish_si7021();


// LED routines
void setled(byte r, byte g, byte b) {
  led.setPixelColor(0, r, g, b);
  led_current_color = led.Color(r,g,b);
  if (light_on) {
    led.show();
  }
}

void setled(byte n, byte r, byte g, byte b) {
  led.setPixelColor(n, r, g, b);
  if (n == 0)
    led_current_color = led.Color(r,g,b);
  if (light_on) {
    led.show();
  }
}

void setled(byte n, byte r, byte g, byte b, byte show) {
  led.setPixelColor(n, r, g, b);
  if (light_on && show) {
    led.show();
  }
}

void setled(byte show) {
  if (!show) {
    int i;
    for (i = 0; i < nrofleds; i++) {
      setled(i, 0, 0, 0, 0);
    }
  }
  led.show();
}

// Debug functions
void log_config () {

  Log.verbose("Smyname = %s",Smyname.c_str());
  Log.verbose("Ssite = %s",Ssite.c_str());
  Log.verbose("Sroom = %s",Sroom.c_str());
  Log.verbose("Sssid = %s",Sssid.c_str());
  Log.verbose("Spass = %s",Spass.c_str());
  Log.verbose("Smqttuser = %s",Smqttuser.c_str());
  Log.verbose("Smqttpass = %s",Smqttpass.c_str());
  Log.verbose("Imqttport = %d",Imqttport);
  Log.verbose(F("Bflipped = %t"),Bflipped);
  Log.verbose(F("Bindoor = %t"),Bindoor);
  Log.verbose(F("Display = %d"),display_what);
  Log.verbose(F("Brightness = %d"),display_brightness);
  if (pir_found)
    Log.verbose(F("Motion detector = %d"),pirInput);
  Log.verbose(F("AS3935 int pin = %d"),as3935_input);
  Log.verbose(F("AS3935 tune cap = %d"),as3935_tunecap);
  Log.verbose(F("nrofleds = %d"),nrofleds);
  Log.verbose(F("CO2alert = %t"),Bco2alert);

