wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
}

void write_config () {
  StaticJsonDocument<512> doc;
  doc["myname"] = Smyname;
  JsonObject display = doc.createNestedObject("display");
  display["flipped"] = Bflipped;
  display["brightness"] = display_brightness;
  display["content"] =display_what;
  JsonObject network = doc.createNestedObject("network");
  network["pass"] = Spass;
  network["ssid"] = Sssid;
  JsonObject mqtt = doc.createNestedObject("mqtt");
  mqtt["server"] = Smqttserver;
  mqtt["user"] = Smqttuser;
  mqtt["pass"] = Smqttpass;
  mqtt["port"] = Imqttport;
  JsonObject location = doc.createNestedObject("location");
  location["site"] = Ssite;
  location["room"] = Sroom;
  location["indoor"] = Bindoor;

  JsonObject sensors = doc.createNestedObject("sensors");
  JsonObject bme280 = sensors.createNestedObject("bme280");
  bme280["tempadjust"] = bme280TempAdjust;

  JsonObject si7021 = sensors.createNestedObject("si7021");
  si7021["tempadjust"] = si7021TempAdjust;

  JsonObject pir;
  if (pir_found) {
    pir = sensors.createNestedObject("pir");
    pir["pin"] = pirInput;
  }
  doc["as3935_input"] = as3935_input;
  doc["as3935_tunecap"] = as3935_tunecap;
  doc["nrofleds"] = nrofleds;
  doc["co2alert"] = Bco2alert;


  Log.notice(F("Writing new config file"));
  serializeJsonPretty(doc,Serial);

  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","w");
  if (!f) {
    Log.error(F("Open of config file for writing failed"));
  } else {
    if (serializeJson(doc,f)) {
      Log.notice(F("Written new config. Now reboot"));
    } else {
      Log.error(F("Writing object into file failed"));
    }
    f.close();
  }
SPIFFS.end();
}

// Logging helper routines
void printTimestamp(Print* _logOutput) {
  char c[12];
  sprintf(c, "%10lu ", millis());
  _logOutput->print(c);
}

void printNewline(Print* _logOutput) {
  _logOutput->print('\n');
}

// MQTT main callback routines
void mqtt_callback(char* topic, byte* payload, unsigned int length)  {

  String in[10];
  unsigned int wordcounter = 0;

  for (unsigned int i = 0; i < length; i++) {
    if ((char)payload[i] == ' ' && wordcounter < 9) {
      wordcounter++;
    } else {
      in[wordcounter] += String((char)payload[i]);
    }
  }
  Log.verbose("Message arrived[%s]: %d Words",topic,wordcounter);
  for (unsigned int i=0; i <= wordcounter; i++)
    Log.verbose("Word[%d] = %s",i,in[i].c_str());

  if (in[0] == "reboot") {
    ESP.restart();
  }

  if (in[0] == "status") {
    publish_status();
  }

  if (in[0] == "led") {
    if (wordcounter == 3) {
      // led r g b
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt());
    } else if (wordcounter == 4) {
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt(),in[4].toInt());
    }
  }

  if (in[0] == "leds") {
    // apply to all leds
    if (wordcounter == 3) {
      int i;
      for (i=0; i < nrofleds; i++)
        setled(i,in[1].toInt(),in[2].toInt(),in[3].toInt());
    }
  }

  if (in[0] == "sensor") {
    // sensor name command
    if (wordcounter >= 1) {
      if (tcs_found && in[1] == "color") {
        if (wordcounter == 1) {
          loop_publish_tcs34725();
        }
        if (wordcounter == 2) {
          if (in[2] == "enable")
            color_watch = 1;
          if (in[2] == "disable")
            color_watch = 0;
        }
        if (wordcounter == 3) {
          if (in[2] == "gain") {
            tcs.setGain((tcs34725Gain_t) atoi(in[3].c_str()));
          }
          if (in[2] == "time") {
            tcs.setIntegrationTime((tcs34725IntegrationTime_t) atoi(in[3].c_str()));
            tcs.begin();
          }
          if (in[2] == "interrupt") {
            tcs.setInterrupt(in[3] == "on");

          }
        }
      }
      if (as3935_found && in[1] == "as3935") {
        if (wordcounter == 1) {
          publish_as3935();
        }
        if (wordcounter == 3) {
          if (in[2] == "tunecap") {
            as3935.tuneCap((uint8_t) atoi(in[3].c_str()));
            delay(50);
            as3935_tunecap = as3935.readTuneCap();
            Log.verbose(F("as3935 tuning capacitor now %d"),
              as3935_tunecap);
          }
        }
      }
      if (bme280_found && in[1] == "bme280") {
        if (wordcounter == 1) {
          publish_bme280();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          bme280.setTemperatureCompensation(atof(in[3].c_str()));
          bme280TempAdjust = bme280.getTemperatureCompensation();
          publish_bme280();
        }
      }
      if (si7021_found && in[1] == "si7021") {
        if (wordcounter == 1) {
          publish_si7021();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          si7021TempAdjust = atof(in[3].c_str());
          publish_si7021();
        }
      }
    }
  }

  if (in[0] == F("config")) {
    if (wordcounter == 0) {
      log_config();
    }
    if (wordcounter == 1) {
      if (in[1] == F("write")) {
        log_config();
        write_config();
      }
    }
    if (wordcounter == 2) {
      if (in[1] == F("room")) {
        Sroom = in[2];
      }
      if (in[1] == F("site")) {
        Ssite = in[2];
      }
      if (in[1] == F("myname")) {
        Smyname = in[2];
      }
      if (in[1] == F("mqttuser")) {
        Smqttuser = in[2];
      }
      if (in[1] == F("mqttpass")) {
        Smqttpass = in[2];
      }
    }
  }

  if (u8x8_found && (in[0] == "display") && (wordcounter >= 1)) {
    last_display = 0;
    display_refresh = true;
    if (in[1] == "humidity") {
      display_what = DISPLAY_HUMIDITY;
    } else if (in[1] == "airpressure") {
      display_what = DISPLAY_AIRPRESSURE;
    } else if (in[1] == F("temperature")) {
      display_what = DISPLAY_TEMPERATURE;
    } else if (in[1] == F("distance")) {
      display_what = DISPLAY_DISTANCE;
    } else if (in[1] == F("temphum")) {
      display_what = DISPLAY_TEMPHUM;
    } else if (in[1] == F("co2")) {
      display_what = DISPLAY_CO2;
    } else if (in[1] == "off") {
      u8x8.clearDisplay();
      display_what = DISPLAY_OFF;
    } else if (in[1] == F("flip")) {
      u8x8.clearDisplay();
      u8x8.setFlipMode(wordcounter > 1);
      Bflipped = (wordcounter > 1);
    } else if (in[1] == F("brightness") && wordcounter >= 2) {
      display_brightness = in[2].toInt();
      Log.verbose(F("Setting brightness to %d"),display_brightness);
      u8x8.setContrast(display_brightness);
    } else { // String
      // large or small?
      // small, if a line is longer than 8 chars or if there are more than 3 lines
      boolean large = true;
      int start;
      for (unsigned int i=1; i<=wordcounter;i++) {
        if (in[i].length() > 8)
          large = false;
      }
      if (wordcounter > 3)
        large = false;

