wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
    if (rmt_bdname) {
        if (rmt_bdname_len > ESP_BT_GAP_MAX_BDNAME_LEN) {
            rmt_bdname_len = ESP_BT_GAP_MAX_BDNAME_LEN;
        }

        if (bdname) {
            memcpy(bdname, rmt_bdname, rmt_bdname_len);
            bdname[rmt_bdname_len] = '\0';
        }
        if (bdname_len) {
            *bdname_len = rmt_bdname_len;
        }
        return true;
    }

    return false;
}

void update_device_info(esp_bt_gap_cb_param_t *param)
{
    char bda_str[18];
    uint32_t cod = 0;
    int32_t rssi = -129; /* invalid value */
    esp_bt_gap_dev_prop_t *p;

    Log.verbose("Device found: %s", bda2str(param->disc_res.bda, bda_str, 18));
    for (int i = 0; i < param->disc_res.num_prop; i++) {
        p = param->disc_res.prop + i;
        switch (p->type) {
        case ESP_BT_GAP_DEV_PROP_COD:
            cod = *(uint32_t *)(p->val);
            Log.verbose("--Class of Device: 0x%x", cod);
            break;
        case ESP_BT_GAP_DEV_PROP_RSSI:
            rssi = *(int8_t *)(p->val);
            Log.verbose("--RSSI: %d", rssi);
            break;
        case ESP_BT_GAP_DEV_PROP_BDNAME:
        default:
            break;
        }
    }

    /* search for device with MAJOR service class as "rendering" in COD */
    app_gap_cb_t *p_dev = &m_dev_info;
    if (p_dev->dev_found && 0 != memcmp(param->disc_res.bda, p_dev->bda, ESP_BD_ADDR_LEN)) {
        return;
    }

    if (!esp_bt_gap_is_valid_cod(cod) ||
            !(esp_bt_gap_get_cod_major_dev(cod) == ESP_BT_COD_MAJOR_DEV_PHONE)) {
        return;
    }

    memcpy(p_dev->bda, param->disc_res.bda, ESP_BD_ADDR_LEN);
    p_dev->dev_found = true;
    for (int i = 0; i < param->disc_res.num_prop; i++) {
        p = param->disc_res.prop + i;
        switch (p->type) {
        case ESP_BT_GAP_DEV_PROP_COD:
            p_dev->cod = *(uint32_t *)(p->val);
            break;
        case ESP_BT_GAP_DEV_PROP_RSSI:
            p_dev->rssi = *(int8_t *)(p->val);
            break;
        case ESP_BT_GAP_DEV_PROP_BDNAME: {
            uint8_t len = (p->len > ESP_BT_GAP_MAX_BDNAME_LEN) ? ESP_BT_GAP_MAX_BDNAME_LEN :
                          (uint8_t)p->len;
            memcpy(p_dev->bdname, (uint8_t *)(p->val), len);
            p_dev->bdname[len] = '\0';
            p_dev->bdname_len = len;
            break;
        }
        case ESP_BT_GAP_DEV_PROP_EIR: {
            memcpy(p_dev->eir, (uint8_t *)(p->val), p->len);
            p_dev->eir_len = p->len;
            break;
        }
        default:
            break;
        }
    }

    if (p_dev->eir && p_dev->bdname_len == 0) {
        get_name_from_eir(p_dev->eir, p_dev->bdname, &p_dev->bdname_len);
        Log.verbose("Found a target device, address %s, name %s", bda_str, (char *)(p_dev->bdname));
        // p_dev->state = APP_GAP_STATE_DEVICE_DISCOVER_COMPLETE;
        // Log.verbose("Cancel device discovery ...");
        // esp_bt_gap_cancel_discovery();
    }
}


void callback_esp32_gap(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param) {
  char bda_str[18];
  char uuid_str[37];

  switch (event) {
    case 1:
      break;
    case ESP_BT_GAP_DISC_RES_EVT:
      sprintf(bda_str,"%02x:%02x:%02x:%02x:%02x:%02x",
        param->disc_res.bda[0],
        param->disc_res.bda[1],
        param->disc_res.bda[2],
        param->disc_res.bda[3],
        param->disc_res.bda[4],
        param->disc_res.bda[5]);
      Log.notice(F("BT Device found %s"),bda_str);
      update_device_info(param);

      break;
    default:
      Log.verbose(F("BT event %d"),event);
      break;
  }
}



void setup_esp32_bluetooth() {
  if (!btStart()) {
    Log.error(F("Failed to initialize bluetooth"));
    return;
  }

  if (esp_bluedroid_init() != ESP_OK) {
    Log.error(F("Failed to initialize bluedroid"));
    return;
  }

  if (esp_bluedroid_enable() != ESP_OK) {
    Log.error(F("Failed to enable bluedroid"));
    return;
  }

  esp_bt_dev_set_device_name(Smyname.c_str());
  esp_bt_gap_register_callback(callback_esp32_gap);
}

void setup_esp32() {
  setup_esp32_bluetooth();
}
#endif

void setup() {
  setup_led();
  setled(255,0,0);
  delay(5000);
  setup_serial();
  setup_logging();
  setup_readconfig();
  log_config();
  pinMode(as3935_input, INPUT);
  setup_i2c();
  if (pir_found)
    setup_pir();
#ifdef ARDUINO_ARCH_ESP32
  setup_esp32();
#endif
  setled(255, 128, 0);
  if (setup_wifi()) {
    setup_mqtt();
    setled(0, 255, 0);
    delay(1000);
    setled(0,0,0);
  } else {
    setled(2,1,0);
  }
  publish_status();
  if (as3935_found)
    pinMode(as3935_input, INPUT);
}

void publish_as3935() {
  String value;
  const __FlashStringHelper *s = F("status/sensors/as3935");
  if (as3935.readMaskDisturber()) {
    mqtt_publish(s,F("disturbers masked"));
  } else {
    mqtt_publish(s,F("disturbers NOT masked"));
  }
  if (as3935.readIndoorOutdoor() == INDOOR) {
    mqtt_publish(s,F("INDOOR"));
  } else {
    mqtt_publish(s,F("OUTDOOR"));
  }
  char buf[32];

  snprintf(buf,31,"%s %d",F("Watchdog Threshold"),
      (int)(as3935.readWatchdogThreshold()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Noise Level"),
      (int)(as3935.readNoiseLevel()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Spike Rejection"),
      (int)(as3935.readSpikeRejection()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Lightning numbers threshold"),
      (int)(as3935.readLightningThreshold()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Tuning capacitor"),
      (int)(as3935.readTuneCap()));
  mqtt_publish(s,buf);


}

void publish_status() {
  const __FlashStringHelper *status = F("status/sensors"),
   *net = F("status/network");
  String ipv4, ipv6, linkLocal;


  if (si7021_found) mqtt_publish(status,F("si7021_found"));
  if (bme280_found) mqtt_publish(status,F("bme280_found"));
  if (bme680_found) mqtt_publish(status,F("bme680_found"));
  if (tsl2561_found) mqtt_publish(status,F("tsl2561_found"));
  if (voltage_found) mqtt_publish(status,F("voltage_found"));
  if (u8x8_found) mqtt_publish(status,F("u8x8_found"));
  if (veml_found) mqtt_publish(status,F("veml_found"));
  if (lox_found) mqtt_publish(status,F("lox_found"));
  if (tcs_found) mqtt_publish(status,F("tcs_found"));
  if (ads1115_found) mqtt_publish(status,F("ads1115_found"));
  if (ccs811_found) mqtt_publish(status,F("ccs811_found"));
  if (pir_found) mqtt_publish(status,F("pir_found"));
  if (as3935_found) {
    mqtt_publish(status, F("as3935_found"));
    publish_as3935();
  }
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish(F("status/ChipID"),(uint32_t)ESP.getChipId());
  mqtt_publish(F("status/ResetReason"),ESP.getResetReason().c_str());
  mqtt_publish(F("status/SdkVersion"),ESP.getSdkVersion());
  mqtt_publish(F("status/SketchSize"),ESP.getSketchSize());
  mqtt_publish(F("status/CycleCount"),ESP.getCycleCount());
#endif

