wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
#if LWIP_IPV6
for (auto a : addrList) {
  a.isV6() ? a.isLocal() ? linkLocal = a.toString() : ipv6 = a.toString() : ipv4 = a.toString();
}

mqtt_publish(F("status/ipv4"), ipv4.c_str());
mqtt_publish(F("status/ipv6ll"), linkLocal.c_str());
mqtt_publish(F("status/ipv6"), ipv6.c_str());
#else
  mqtt_publish(F("status/ipv6"),F("disabled"));
#endif
}

void loop_publish_voltage(){
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish("voltage", (float)(ESP.getVcc() / 1000.0));
  mqtt_influx("voltage", (float)(ESP.getVcc() / 1000.0));
#endif
}

void loop_publish_tsl2561() {
  if (tsl2561_found) {
    sensors_event_t event;

    if (tsl2561.begin()) {
      uint16_t br, ir;
      tsl2561.getLuminosity(&br, &ir);
      uint32_t lux = tsl2561.calculateLux(br, ir);
      mqtt_publish("light",lux);
      mqtt_influx("light",lux);
    } else {
      Log.verbose("loop_publish_tsl2561: Sensor not initialized");
    }
  }
}

void publish_bme280() {
  if (bme280_found) {
    mqtt_publish(F("bme280/tempadjust"),
      (float)bme280.getTemperatureCompensation());
  }
}

void publish_si7021() {
  if (si7021_found) {
    mqtt_publish(F("si7021/tempadjust"),
      (float)si7021TempAdjust);
  }
}

void loop_publish_bme280() {
  if (bme280_found) {
    mqtt_publish("temperature", bme280.readTemperature());
    mqtt_publish("airpressure", bme280.readPressure() / 100.0F);
    mqtt_publish("humidity", bme280.readHumidity());
    mqtt_influx("temperature", bme280.readTemperature());
    mqtt_influx("airpressure", bme280.readPressure() / 100.0F);
    mqtt_influx("humidity", bme280.readHumidity());
  }
}

void loop_publish_bme680() {
  if (bme680_found && bme680.performReading()) {
    mqtt_publish("temperature", bme680.temperature);
    mqtt_publish("airpressure", bme680.pressure / 100.0F);
    mqtt_publish("humidity", bme680.humidity);
    mqtt_publish("airquality", bme680.gas_resistance / 1000.0F);

    mqtt_influx("temperature", bme680.temperature);
    mqtt_influx("airpressure", bme680.pressure / 100.0F);
    mqtt_influx("humidity", bme680.humidity);
    mqtt_influx("airquality", bme680.gas_resistance / 1000.0F);

  }
}



void loop_publish_veml6070() {
  if (veml_found) {
    mqtt_publish("UV", veml.readUV());
    mqtt_influx("UV", veml.readUV());
  }
}

int co2ampel(int co2value) {
  if (Bco2alert) {
    if (co2value <=1000) {
      setled(0,255,0);
    } else if (co2value <= 2000) {
      setled(255,255,0);
    } else {
      setled(255,0,0);
    }

  }
  return co2value;
}

void loop_publish_ccs811() {
  if (ccs811_found) {
    if (ccs.available()) {
      if (!ccs.readData()) {
        mqtt_publish("CO2", co2ampel(ccs.geteCO2()));
        mqtt_publish("TVOC", ccs.getTVOC());
        mqtt_influx("CO2",co2ampel(ccs.geteCO2()));
        mqtt_influx("TVOC",ccs.getTVOC());
      } else {
        Log.verbose(F("Error reading data from CCS811"));
      }
    } else {
      Log.verbose(F("No data available at CCS811"));
    }
  }
}


void loop_publish_si7021() {
  if (si7021_found) {
    mqtt_publish("temperature", si7021.readTemperature() + si7021TempAdjust);
    mqtt_publish("humidity", si7021.readHumidity());
    mqtt_influx("temperature", si7021.readTemperature() + si7021TempAdjust);
    mqtt_influx("humidity", si7021.readHumidity());
  }
}

void loop_publish_tcs34725() {
  if (tcs_found) {
    uint16_t r,g,b,c;
    tcs.getRawData(&r,&g,&b,&c);

    Log.verbose(F("TCS Color raw: R=%d G=%d B=%d C=%d"),r,g,b,c);
    uint16_t minval = min(min(r,g),b);
    uint16_t maxval = max(max(r,g),b);

    int d1 = abs(r-g);
    int d2 = abs(r-b);
    int d3 = abs(g-b);

    int maxdist = max(max(d1,d2),d3);
    int mindist = min(min(d1,d2),d3);

    if (maxdist > 40) {
      r = map(r,minval,maxval,0,255);
      g = map(g,minval,maxval,0,255);
      b = map(b,minval,maxval,0,255);
    }

    setled(r,g,b);
    Log.verbose(F("TCS Color adj: R=%d G=%d B=%d C=%d"),r,g,b,c);
  }
}

static unsigned long lastReportTime = 0;
static bool lastReportState = false;

void loop_publish_motion(bool m) {
  // report motion (true or false)
  // remember when last report was and report only once a minute


//  if (lastReportTime + 60l*1000l > millis())
//    return;

  lastReportTime = millis();
  lastReportState = m;
  mqtt_influx("motion", m);
  mqtt_publish("motion", (int) m);
}

int loop_get_lox_distance() {
  if (lox_found) {
    VL53L0X_RangingMeasurementData_t measure;
    lox.rangingTest(&measure);
    if (measure.RangeStatus != 4) {
      // mqtt_influx(F("distance"), measure.RangeMilliMeter);
      return measure.RangeMilliMeter;
    }
  }
  return -1;
}

void lights_on(int dist) {
  bool x = false;

  if (dist == 1406)
    return;

 if ((dist > 0) && (dist < 500))
    x = true;

  if (x == light_on)
    return;

  Log.verbose(F("Lights on? %T %d mm"),x,dist);

  light_on = x;

  if (x) {
    led.setPixelColor(0, led_current_color);
    led.show();
    loop_publish_motion(true);
  } else {
    led_current_color = led.getPixelColor(0);
    led.clear();
    led.show();
    loop_publish_motion(false);
  }

  if (u8x8_found) {
    if (x) {
      u8x8.setContrast(255);
    } else {
      u8x8.setContrast(display_brightness);
    }
  }
}

// read PIR if it exists
void loop_pir() {
  if (pir_found) {
    int pir_old = pirState;
    pirState = digitalRead(pirInput);
    // Low -> Low
    if (pir_old == LOW && pirState == LOW)
      return;
    // Low -> High
    if (pir_old == LOW && pirState == HIGH) {
      loop_publish_motion(true);
    }

    // High -> High
    if (pir_old == HIGH && pirState == HIGH)
      return;
    // High -> Low
    if (pir_old == HIGH && pirState == LOW) {
      loop_publish_motion(false);
    }
  }
}

static int noiseCount=0;
static int totalDisturberCount=0;
static int loopcount = 0;
void loop_as3935() {
  byte watchDogVal = as3935.readWatchdogThreshold();
  if (digitalRead(as3935_input) == HIGH) {
    lightningStatus intReason = (lightningStatus) as3935.readInterruptReg();
    if (intReason == NOISE_TO_HIGH) {
      Log.verbose(F("as3935: noise %d"),++noiseCount);
      byte noiseFloor = as3935.readNoiseLevel();
      if (noiseCount > 2 && noiseFloor < 7) {
        as3935.setNoiseLevel(++noiseFloor);
        Log.verbose(F("as3935: noiseFloor %d"),noiseFloor);
      }
    }
    if (intReason == DISTURBER_DETECT) {
      Log.verbose(F("as3935: disturber %d"),++totalDisturberCount);
      if (totalDisturberCount > 2) {
        if (watchDogVal < 10) {
          as3935.watchdogThreshold(++watchDogVal);
          Log.verbose(F("as3935: watchDogVal %d"),watchDogVal);
        } else {
          as3935.maskDisturber(true);
          Log.verbose(F("as3935: Disturbers masked"));
        }
      }
    }
    if (intReason == LIGHTNING) {
      byte distance = as3935.distanceToStorm();
      uint32_t energy = as3935.lightningEnergy();
      Log.notice(F("as3935: Lightning detected in %d km, energy %u"),distance,energy);
      mqtt_publish(F("lightning/distance"), (uint32_t)distance);
      mqtt_publish(F("lightning/energy"), energy);
      mqtt_influx(F("lightning/distance"), distance);
      mqtt_influx(F("lightning/energy"), energy);

